{
  "team": [
    {
      "name": "Paul Chiusano",
      "description": "is one of the founders of Unison Computing, a creator of the Unison programming language, and coauthor of the bestselling book [Functional Programming in Scala](https://bookshop.org/p/books/functional-programming-in-scala-second-edition-michael-pilquist/e3b6935687828fcd?ean=9781617299582&next=t). He loves functional design, distributed systems, and enjoys teaching and mentoring. At Unison, he maintains numerous libraries, such as Arcella, a collection of scalable distributed data structures atop object storage. Prior to Unison, he helped build out the Scala functional programming ecosystem, including the FS2 stream processing library.",
      "skills": [
        "Scala",
        "Haskell",
        "Unison",
        "Java",
        "Elm",
        "Python",
        "compilers",
        "type theory",
        "distributed systems",
        "functional programming",
        "data structures and algorithms"
      ],
      "base": "New Orleans, LA (Time Zone: CST, GMT-6)",
      "linkedin": "https://www.linkedin.com/in/pchiusano/",
      "github": null,
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Rúnar Bjarnason",
      "description": "is a cofounder of Unison Computing, a creator of the Unison programming language, and coauthor of [Functional Programming in Scala](https://bookshop.org/p/books/functional-programming-in-scala-second-edition-michael-pilquist/e3b6935687828fcd?ean=9781617299582&next=t). He is an expert in functional design and maintains Unison’s standard library along with more than a dozen additional Unison libraries. Before founding Unison Computing, he played a key role in building out the Scala functional programming ecosystem and was a frequent conference speaker.",
      "skills": [
        "Scala",
        "Haskell",
        "Unison",
        "Java",
        "compilers",
        "distributed systems",
        "functional programming",
        "database systems"
      ],
      "base": "Boston, MA (Time Zone: EST, GMT-5)",
      "linkedin": "https://www.linkedin.com/in/runaroli/",
      "github": null,
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Arya Irani",
      "description": "Arya Irani is another founder of Unison Computing and co-creator of the Unison programming language. He has a PhD from Georgia Tech for research in Artificial Intelligence and blended conventional/agentic software systems and now leads AI efforts at Unison Computing, as well as the UCM tool team.\n\nPrior to Unison, he developed functional web services for the US Army Family Advocacy Program and Centers for Disease Control and has contributed to the Scala ecosystem (cats, shapeless, scalaz, http4s). He enjoys helping teams make systems faster, clearer, and more correct by construction.",
      "skills": [
        "functional programming",
        "Haskell",
        "Unison",
        "Scala",
        "Java",
        "Elm",
        "C/C++",
        "Perl",
        "concurrency",
        "type-level programming",
        "algorithm design",
        "reinforcement learning",
        "interactive machine learning",
        "hybrid agentic systems",
        "tweaking a prompt a little bit and hoping for the best"
      ],
      "base": "Todos Santos, BCS (Time Zone: MST, GMT-7)",
      "linkedin": null,
      "github": null,
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Fabio Labella",
      "description": "loves principled, high performance solutions to real-world problems. At Unison Computing, he built a distributed transactions layer, an exactly-once streaming engine, and an AWS Kinesis clone. Before joining Unison, he was in charge of architecture and technical strategy at Kaluza, a Kafka-based energy platform serving millions of customers. He is one of the core designers of cats-effect, the green threading runtime for Scala, and has trained hundreds of engineers on topics ranging from programming language theory to distributed systems design.",
      "skills": [
        "distributed systems design",
        "concurrency",
        "Kafka",
        "DynamoDb",
        "streaming-first architectures",
        "Scala",
        "Haskell",
        "JVM",
        "functional programming",
        "programming language/library design",
        "technical strategy",
        "fractional CTO leadership",
        "training and mentoring"
      ],
      "base": "London, UK (Time Zone: GMT, but comfortable with significant overlap with CST)",
      "linkedin": "https://www.linkedin.com/in/fabiolabella/",
      "github": null,
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Chris Penner",
      "description": "is a highly-experienced functional programmer and the maintainer of [Unison Share](https://share.unison-lang.org), a Haskell + Postgres application. He’s also the author of [Optics by Example - Functional Lenses in Haskell](https://leanpub.com/optics-by-example/) and has delivered many conferences talks teaching functional programming principals. Chris has a wealth of experience deploying functional programming in real-world applications such as end-to-end encrypted chat, web-applications and command-line apps.",
      "skills": [
        "Haskell",
        "Functional Programming architecture",
        "concurrency",
        "Optics/Lenses",
        "Servant APIs",
        "Postgres",
        "SQLite",
        "web applications",
        "LSP servers",
        "MCP servers",
        "application infrastructure"
      ],
      "base": "Victoria, British Columbia, Canada (Time Zone: PST, UTC-8)",
      "linkedin": "https://www.linkedin.com/in/christopher-penner-29089561/",
      "github": null,
      "share": null,
      "personal": "http://chrispenner.ca",
      "resume": null
    },
    {
      "name": "Rebecca Mark",
      "description": "is a software engineer and technical educator who brings genuine joy to the work of building a team's long-term engineering capabilities. Her approach combines hands-on implementation with deliberate knowledge transfer, so organizations reap immediate results and gain an enriched team, capable of sustaining and extending their work. Most recently, Rebecca has led developer education at Unison, creating foundational programming language content, reference applications, and technical workshops. Before that, she spent three years at 47 Degrees consulting on enterprise projects. In each engagement, she worked closely with client engineers to build their internal capabilities through pairing, code reviews, and learning events.",
      "skills": [
        "Scala",
        "Unison",
        "microservice architectures",
        "training and education",
        "staff augmentation"
      ],
      "base": "Seattle, Washington (Time Zone: Pacific Time, UTC-8)",
      "linkedin": "https://www.linkedin.com/in/rebecca-mark-31253728/",
      "github": null,
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Cody Allen",
      "description": "is a functional programmer and infrastructure engineer who has solved real-world problems for both startups and Fortune 500 companies. He loves declarative code and infrastructure but believes that project success depends on effective communication more than technology choices. At Unison Computing he was one of the core developers of Unison Cloud, which specializes in sandboxing user-provided code and executing it in a clustered environment to power distributed web services, batch jobs, and daemons. Prior to Unison, as a Lead Machine Learning Engineer at Salesforce, he wrote Scala libraries and Spark jobs that sifted through a noisy data lake to identify and anonymize valuable training data. Cody has contributed to a variety of open source projects including authoring hundreds of commits in the Scala functional programming library [cats](https://typelevel.org/cats/).",
      "skills": [
        "all things AWS",
        "declarative infrastructure",
        "systems design",
        "web services",
        "functional programming",
        "library design",
        "Unison",
        "Scala",
        "Haskell",
        "JVM",
        "Terraform",
        "Docker/Podman",
        "systemd",
        "NixOS",
        "Grafana",
        "Prometheus",
        "Consul",
        "Nomad",
        "Vault",
        "Spark",
        "AWS"
      ],
      "base": "Indianapolis, IN (Time Zone: Eastern Time, UTC-5)",
      "linkedin": null,
      "github": "https://github.com/ceedubs/",
      "share": null,
      "personal": null,
      "resume": "/team/cody-allen-resume"
    },
    {
      "name": "Dan Doel",
      "description": "has nearly two decades of Haskell experience. He believes that the best results come from a synthesis of theoretical knowledge and practical experience, with each helping to inform the other. At Unison Computing, he has worked extensively on the language runtime and type system, adding major new capabilities to each. Prior to Unison, he worked for S&P Global where he co-created a domain specific language for reporting and visualization and worked on systems for large-scale portfolio analytics.",
      "skills": [
        "Haskell",
        "Unison",
        "Scala",
        "Java",
        "SQL",
        "compilers",
        "interpreters",
        "functional programming",
        "type theory"
      ],
      "base": "Boston, MA (Time Zone: EST, UTC-5)",
      "linkedin": "https://www.linkedin.com/in/dandoel/",
      "github": "https://github.com/dolio",
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Stew O'Connor",
      "description": "is an infrastructure engineer with a long and varied past of both writing software and maintaining the servers it runs on. He was responsible for programming and administering the first ever online stores for many fashion brands including Fila, Vera Wang, and Lanvin. He authored email software for poorly connected African communities that lead to him administering the first web and email presences for the government of Chad. And he managed large server deployments for Fortune 500 companies, including machine learning clusters performing content analytics for Verizon FIOS and AI workloads for inventory positioning for Target.\n\nStew has been a long time contributor to free software. He was a Debian Developer on the FTP team which was responsible for running the apt-get repositories. He was a staff member on the Freenode IRC network, and he made significant contributions to the scalaz and cats functional programming ecosystems. At Unison, Stew helped build Unison Cloud and operating it reliably.",
      "skills": [
        "AWS",
        "Linux",
        "Terraform",
        "Ansible",
        "Unison",
        "Scala",
        "Java",
        "Haskell",
        "Python",
        "Rust"
      ],
      "base": "San Jose, CA (Pacific Time, UTC-8)",
      "linkedin": "/2ac5fbdd830d8073bccedc6d1b847921?pvs=25",
      "github": "https://github.com/stew",
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Simon Hoejberg",
      "description": "is a Principal Frontend Engineer and designer with more than 20 years experience. He has a relentless focus on UX above everything else.\n\nThroughout his career Simon has worked on payment processing, distributed Point of Sales systems with self-healing offline support, Tufte-ian visualizations for restaurants and to aid in mental healthcare.\n\nAt Unison, he is single-handedly responsible for the front-end development and design of [Unison Share](https://share.unison-lang.org), our code hosting platform and [UCM desktop](https://github.com/unisonweb/ucm-desktop), our companion desktop app.",
      "skills": [
        "Elm",
        "Unison",
        "Functional Programming",
        "JavaScript",
        "TypeScript",
        "React",
        "React Native",
        "HTML",
        "CSS",
        "Visualizations",
        "UX Design"
      ],
      "base": "Seekonk, MA (Time Zone: Eastern Time, UTC-5)",
      "linkedin": "https://www.linkedin.com/in/hojberg/",
      "github": "https://github.com/hojberg",
      "share": null,
      "personal": null,
      "resume": null
    },
    {
      "name": "Mitchell Dalvi Rosen",
      "description": "is a highly experienced functional programmer who specializes in building performant, maintainable systems. He places a strong emphasis on user experience, ensuring software he builds is intuitive and pleasant to use. At Unison Computing, he works on the Unison Codebase Manager, a Haskell application that handles compilation, code versioning, semantic code merging, code analysis, and more.\n\nMitchell is the author and maintainer of several open-source Haskell libraries related to concurrency, databases, and functional data structures. He also develops and maintains free and open-source applications for self-hosted and homelab environments.",
      "skills": [
        "Haskell",
        "Unison",
        "functional programming",
        "concurrency",
        "developer tooling",
        "functional data structures",
        "ergonomic API design",
        "SQL query optimization",
        "web application architecture",
        "full-stack web development",
        "Elm",
        "Postgres",
        "SQLite",
        "Riak"
      ],
      "base": "Somerville, MA (Time Zone: EST, UTC-5)",
      "linkedin": "https://www.linkedin.com/in/mitchell-dalvi-rosen-142b256b/",
      "github": "https://github.com/mitchellwrosen",
      "share": null,
      "personal": null,
      "resume": null
    }
  ]
}
